[
  {
    "id": "convo",
    "title": "CONVO",
    "slug": "convo",
    "tags": ["Android/iOS", "React Native"],
    "descShort": "<p>A native mobile chat app running on iOS and Android. Built with React Native the application provides an interface for users to send messages, images and their location.</p>",
    "objective": "<p>CONVO is a cross compatible mobile device chat application that allows users to send and receive messages in real time. In addition to simple text based messages, the app is to provide an interface to share images and current location.</p>",
    "solution": "<p>CONVO is built using the React Native framework leveraging the Expo development platform for cross platform mobile app development. Facilities for permissions, image and location sharing are achieved using the Expo API library.</p><p>Google’s firebase is used for user authentication, storing messages, images and other required data fields.</p><p>That chat application interface is built with the ‘Gifted Chat’ library to provide a complete and familiar feel to the application</p>",
    "image": "./images/projects/convo/main.png",
    "tech": ["react", "expo", "firebase"],
    "mobileScreen": "./images/projects/convo/mobile2.png",
    "desktopScreen": "./images/projects/ello/desktop.jpg",
    "link": null,
    "repo": "https://github.com/James-Coates/convo",
    "colorDark": "#6B26CA",
    "featured": true,
    "mobileOnly": true
  },
  {
    "id": "ello",
    "title": "ello*",
    "slug": "ello",
    "tags": ["Web App", "React", "PWA", "TDD"],
    "image": "./images/projects/ello/main.png",
    "descShort": "<p>ello* is a progressive web application integrating with the Meetup API to provides users with access to all the Meetup events. Browse through events in your area or search events in any city across the globe.</p>",
    "objective": "<p>Ello is designed to offer Meetup event search related features in the form of a progressive web application (a site that offering advanced features such as offering a native application feel)</p>",
    "solution": "<p>A test driven development approach was followed to build this prototype which interacts with the Meetup API using a serverless framework.</p><p>The web app provides a filterable list of events that can be selected for further details.</p>",
    "tech": ["react", "amazonaws"],
    "mobileScreen": "./images/projects/ello/mobile.jpg",
    "desktopScreen": "./images/projects/ello/desktop.jpg",
    "link": "https://james-coates.github.io/meetup/",
    "repo": "https://github.com/James-Coates/meetup",
    "colorDark": "#0B132B",
    "featured": false
  },
  {
    "id": "flix",
    "title": "FLIX",
    "slug": "flix",
    "tags": ["Web App", "React", "API"],
    "image": "./images/projects/flix/main.png",
    "descShort": "<p>A movie database web app providing details on a range of titles, genres and directors. The app retrieves a select collection of movie information from a self built API. Users can also sign up to the platform and store a collection of their favourite movies.</p>",
    "objective": "<p>FLIX is a prototype for a web application offering information on movies. This build is limited to movies, genres and directors on a select view movie records.</p><p>The application includes a back-end for handling user requests and serving data from a Mongodb database. It also includes a client facing front-end which displays information from the API to the user.</p>",
    "solution": "<p>This prototype build is limited to information on movies, genres and directors for a small collection of movie records.</p>The application includes a back-end for handling user requests and serving data from a Mongodb database.</p><p>FLIX also includes a client facing front-end which displays information from the API to the user and provides user authentication features to store custom user data such as a list of favourite movies</p>",
    "tech": ["react", "node-dot-js", "mongodb"],
    "mobileScreen": "./images/projects/flix/mobile.jpg",
    "desktopScreen": "./images/projects/flix/desktop.jpg",
    "link": "https://flix-db.herokuapp.com/",
    "repo": "https://github.com/James-Coates/flix",
    "colorDark": "#0A1C43",
    "featured": true
  },
  {
    "id": "todo",
    "title": "Todo App",
    "slug": "to-do",
    "tags": ["Web App", "Vue"],
    "image": "./images/projects/todo/main.png",
    "descShort": "<p>A simple ‘To-Do’ web application built using the Vue.js framework and UI based on Google’s Material design system.</p>",
    "objective": "<p>To familiarise myself with the Vue.js framework by building a simple application to allow users to type, store and delete a list of to-do items.</p>",
    "solution": "<p>The outcome is a simple application for storing user ‘To-Dos’. The web app, built with Vue.js is based off of Google’s material design framework to provide a clean and intuitive feel.</p>",
    "tech": ["vue-dot-js"],
    "mobileScreen": "./images/projects/todo/mobile.jpg",
    "desktopScreen": "./images/projects/todo/desktop.jpg",
    "link": "https://to-do-vue.herokuapp.com/",
    "repo": "https://github.com/James-Coates/to-do-vue",
    "colorDark": "#252525"
  },
  {
    "id": "btcquiz",
    "title": "The Bitcoin Quiz App",
    "slug": "btc-quiz",
    "tags": ["Web App", "Angular"],
    "image": "./images/projects/btc-quiz/main.png",
    "descShort": "<p>A web app offering a selection of Bitcoin related quizzes. The application was built using the Angular framework leveraging the Bootstrap library for the user interface.</p>",
    "objective": "<p>This project served as my introduction to the Angular framework and my primary objective was to provide a simple and clean user interface for a simple web app.</p><p>The application would offer a selection of multiple choice quizzes. Once a quiz is complete the user will be shown the results and offered to pick another quiz.</p>",
    "solution": "<p>A clean and simple UI offering Bitcoin quizzes at three difficulty levels.</p>",
    "tech": ["angular", "bootstrap"],
    "mobileScreen": "./images/projects/btc-quiz/mobile.jpg",
    "desktopScreen": "./images/projects/btc-quiz/desktop.jpg",
    "link": "https://bitcoin-quiz-app.herokuapp.com/welcome",
    "repo": "https://github.com/James-Coates/bitcoin-quiz-app",
    "colorDark": "#F18F18",
    "featured": true
  },
  {
    "id": "pokedex",
    "title": "Pokedex",
    "slug": "pokedex",
    "tags": ["Javascript"],
    "image": "./images/projects/pokedex/main2.png",
    "descShort": "<p>A simple web app built in HTML, CSS and Javascript that uses the Pokemon API to simulate the effect of a pokedex by providing information on a list of Pokemon.</p>",
    "objective": "<p>To build a small web application with HTML, CSS, and JavaScript that loads data from an external API and enables the viewing of data points in detail.</p>",
    "solution": "<p>Data is fed from the pokemon API and displayed within a simple but modern user interface.</p><p>The logic behind the API and the front-end is written in pure Vanilla Javascript. A call is made to the pokemon API once the page loads to display the full list of pokemon. On selecting a Pokemon to view a separate API call is made to retrieve and display its details screen.</p>",
    "tech": ["javascript", "html5", "css3"],
    "mobileScreen": "./images/projects/pokedex/mobile.jpg",
    "desktopScreen": "./images/projects/pokedex/desktop.jpg",
    "link": "https://james-coates.github.io/cf-pokedex/",
    "repo": "https://github.com/James-Coates/cf-pokedex",
    "colorDark": "#161A1E",
    "featured": true
  }
]